I just ran into this issue and after an embarrassing amount of debugging, I realized it was because I needed to run a refresh.

1. I ran a plan, which takes a while for us
2. I updated the provider
3. I re-ran the plan with `-refresh=false` (because it takes a while, and I had just refreshed)
4. I got the output below

Simply running the plan with a refresh fixed it for me.

```Terraform will perform the following actions:

  # google_compute_global_address.vpc-peering-private-services must be replaced
-/+ resource "google_compute_global_address" "vpc-peering-private-services" {
      ~ address            = "x.x.x.x" -> (known after apply)
      ~ creation_timestamp = "2022-01-01T00:00:00.000-07:00" -> (known after apply)
      ~ id                 = "projects/example-project/global/addresses/vpc-peering-private-services" -> (known after apply)
        name               = "vpc-peering-private-services"
      ~ network            = "https://www.googleapis.com/compute/v1/projects/example-project/global/networks/dev-network" -> (known after apply) # forces replacement
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/example-project/global/addresses/vpc-peering-private-services" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # google_service_networking_connection.vpc-peering-connection must be replaced
-/+ resource "google_service_networking_connection" "vpc-peering-connection" {
      ~ id                      = "projects%2Fexample-project%2Fglobal%2Fnetworks%2Fdev-network:servicenetworking.googleapis.com" -> (known after apply)
      ~ network                 = "projects/example-project/global/networks/dev-network" -> (known after apply) # forces replacement
      ~ peering                 = "servicenetworking-googleapis-com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.google_compute_network.network must be replaced
-/+ resource "google_compute_network" "network" {
      - enable_ula_internal_ipv6                  = false -> null
      + gateway_ipv4                              = (known after apply)
      ~ id                                        = "projects/example-project/global/networks/dev-network" -> (known after apply)
      + internal_ipv6_range                       = (known after apply)
        name                                      = "dev-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL" # forces replacement
      ~ self_link                                 = "https://www.googleapis.com/compute/v1/projects/example-project/global/networks/dev-network" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.```